Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: བརྟན་པ འི་ བླ་ གྲོས་ འདི་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ ས་ འཇིག་རྟེན་ གྱི་ ཁམས་ ག་གེ་མོ་ ཞེས་ བྱ་བ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཆེ་གེ་མོ་ ཞེས་ བྱ་བ་ ཆོས་སྟོན་ ཏོ །_། |#| ཞེས་ དེ་བཞིན་ གཤེགས་པ་ གཅིག་ གི་ མཚན་ ཐོས་པ ར་ བྱེད་ དོ །_།
en: Dṛḍhamati, this is when bodhisattva great beings proclaim the name of a single thus-gone one by saying, ‘Such-and-such thus-gone one is teaching the Dharma in such-and-such world system.’

source: དེ་དེ་ བཞིན་ གཤེགས་པ་ དེ འི་ མཚན་ ཐོས་ ནས་ མཚན་མ འི་ སྒོ་ ནས་ ལེགས་པ ར་ འཛིན་པ ར་ བྱེད །_ |#| མཚན་མ འི་ རྣམ་པ་ མདུན་ དུ་ བྱེད །_ |#| མངོན་དུ་ བྱེད་ དོ །_།
en: Hearing the name of that thus-gone one causes them to apprehend the thus-gone one in terms of his features, to aspire to such features themselves, and to actualize them.

source: དེ་དེ་ བཞིན་ གཤེགས་པ་ བྱང་ཆུབ་ ཀྱི་ སྙིང་པོ་ མཆོག་ ན་ བཞུགས་པ འམ །_ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ མངོན་པར་ རྫོགས་ པ ར་ སངས་རྒྱས་པ འམ །_ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ འམ །_ ཉན་ཐོས་ ཀྱི་ ཚོགས་ ཀྱིས་ ཡོངས་སུ་ བསྐོར་བ འམ །_ ཆོས་སྟོན་པ་ འབའ་ཞིག་ དྲན་པ་ རྣམ་པར་ མི་ གཡེང་བ་ དང་ །_ དབང་པོ་ མི་རྒོད་པ་ དག་ དང་ །_ ཡིད་ ཕྱི་རོལ་ ཏུ་ མ་ སོང་བ ས་ ཡིད་ ལ་ བྱེད་ དོ །_།
en: They bring to mind—with undistracted recollection, unperturbed faculties, and non-distracted attention—only the thus-gone one, either seated on the supreme seat of awakening, or fully awakening to unexcelled and perfect buddhahood, or turning the wheel of Dharma, or surrounded by an assembly of hearers, or teaching the Dharma.

source: དེ་དེ་ བཞིན་ གཤེགས་པ་ དེ འི་ མཚན་མ་ རྗེས་ སུ་ དྲན་པ ས་ འཇིག་རྟེན་ གྱི་ ཁམས་ ལ་ དམིགས་པ་ མདུན་ དུ་ བྱེད་ དོ །_།
en: By recollecting the name of that thus-gone one they bring before themselves the perception of his world system.

source: དེ་དེ་ བཞིན་ གཤེགས་པ་ ལ་ དམིགས་པ་ དང་ །_ འཇིག་རྟེན་ གྱི་ ཁམས་ ལ་ དམིགས་པ་ ཡང་ འདི་ལྟ་སྟེ །_ |#| དམིགས་པ་ མེད་པ་ ཉིད་ ཀྱིས་ དམིགས་པ་ གཅིག་པ་ ཉིད་ དུ་ རྟོགས་པ ར་ བྱེད་ དོ །_།
en: Moreover, it also makes them understand their perception of the thus-gone one and his world system as exclusively perceived by way of non-apprehending.

source: དེ་དེ་ ལྟར་ གནས་ ཤིང་ སྦྱོར་བ་ དེ་ རྗེས་སུ་ མི་ གཏོང་བ ས་ དེ་བཞིན་ གཤེགས་པ འི་ སྐུ་ མངོན་དུ་ འགྱུར་ རོ །_།
en: By adhering to that and not discarding that connection, the awakened body of a thus-gone one will be actualized.

source: དེ་ ཆོས་སྟོན་པ་ ཡིད་ ལ་ བྱེད་པ ས་ ཟབ་པ་ དང་ །_ གསལ་བ་ དང་ །_ དོན་ དང་ ཚིག་འབྲུ འི་ སྒོ་ ནས་ ཇི་ལྟ་ ཇི་ལྟ ར་ མོས་པ་ དེ་ལྟ་ དེ་ལྟ ར་ ཡང་ མདུན་ དུ་ བྱེད་ དོ །_།
en: By bringing to mind the teaching of the Dharma, they also bring it before themselves by means of the profound, the lucid, meanings, and syllables, precisely how they are inclined toward it.

source: དེ་ ཏིང་ངེ་འཛིན་ དེ་ ལ་ གནས་ ནས་ དངོས་པོ་ ཐམས་ཅད་ རྣམ་པར་ འཇིག་པ་ ཉིད་ ཀྱིས་ དེ་བཞིན་ གཤེགས་ པ འི་ ཆོས་ བསྟན་པ་ ཉན་པ ར་ བྱེད་ དོ །_།
en: Abiding in that absorption, they are motivated by the perishability of all things to listen to the Dharma taught by the thus-gone one.

source: དེ་ ཆོས་ བསྟན་པ་ དེ་དག་ ཀུན་ ལེན་པ ར་ བྱེད་ ཅིང་ འཛིན་པ ར་ བྱེད་ དོ །_།
en: They are motivated to receive and uphold all those teachings that are taught.

source: བླངས་ ཤིང་ བཟུང་ ནས་ ཀྱང་
en: Having received and upheld them,

source: ཏིང་ངེ་འཛིན་ དེ་ལས་ ལངས་ ནས་ འཁོར་ བཞི་པོ་ དག་ ལ་ ཆོས་སྟོན་ ཏེ །_
en: they rise from that absorption and teach the fourfold retinue.

source: འཇུག་པ་ དེ་ དང་ དམིགས་པ་ དེ་ ནི་ འདི་ལྟ་སྟེ །_ |#| བཀོད་པ་ གཅིག་པ འི་ ཏིང་ངེ་འཛིན་ མངོན་པར་ སྒྲུབ་པ་ [219a] ཡིན་ ནོ །_།
en: That engagement and that perception are, in this vein, the accomplishment of the absorption of the single array. [219.a]

source: བརྟན་པ འི་ བློ་གྲོས་ གཞན་ ཡང་ བྱང་ཆུབ་ སེམས་དཔའ་ ནི་ ཡང་ དམིགས་པ་ དེ་ཉིད་ རྣམ་པར་ འཇིག་པ ར་ བྱེད་ ཅིང་ །_ བདག་ཉིད་ ཀྱི་ ལུས་ ཀྱང་ རྣམ་པར་ འཇིག་པ ར་ བྱེད་ དོ །_།
en: $1933 “Furthermore, Dṛḍhamati, bodhisattvas also destroy that very perception and destroy their own body too.

source: དེ་ དངོས་པོ་ ཐམས་ཅད་ རྣམ་པར་ འཇིག་པ་ ཉིད་ ཀྱིས་ བཀོད་པ་ གཅིག་པ འི་ ཏིང་ངེ་འཛིན་ ལ་ འཇུག་པ ར་ བྱེད་ དོ །_།
en: The perishability of all things inducts them into the absorption of the single array .

source: དེ་དེ་ ལས་ ལངས་ ནས་ ཀྱང་ ཡང་ འཁོར་ བཞི་པོ་ དག་ ལ་ ཆོས་སྟོན་ པར་ བྱེད་ དེ །_
en: Rising from that, they are also led to teach the Dharma to the fourfold retinue.

source: བརྟན་པ འི་ བློ་གྲོས་ འདི་ ཡང་ བཀོད་པ་ གཅིག་པ འི་ ཏིང་ངེ་འཛིན་ མངོན་པར་ སྒྲུབ་པ་ ཡིན་ ནོ །_།
en: Dṛḍhamati, this too is the accomplishment of the absorption of the single array.

source: བརྟན་པ འི་ བློ་གྲོས་ གཞན་ ཡང་ བྱང་ཆུབ་ སེམས་དཔའ་ ནི་ དེ་བཞིན་ གཤེགས་པ འི་ སྐུ་ ལ་ དམིགས་པ་ དེ་ཉིད་ ལ་ འདི་ལྟར་ སོ་སོ ར་ རྟོག་པ ར་ བྱེད་ དོ །_། |#| དེ་བཞིན་ གཤེགས་པ འི་ སྐུ་ དེ་ག་ ལས་ འོངས །_ |#| བདག་ ཀྱང་ གང་ དུ་ སོང་ ཞིག་ གུ་ སྙམ་ ནས །_
en: $1934 “Furthermore, Dṛḍhamati, bodhisattvas are led to analyze that very perception of the thus-gone one’s awakened body by thinking, |#| ‘Where did the thus-gone one’s awakened body come from, and where have I gone?’

source: དེ་དེ་ བཞིན་ གཤེགས་པ་ ཡང་ མ་འོངས་པ ར་ རབ་ཏུ་ ཤེས་ ཤིང་ །_ བདག་ཉིད་ ཀྱང་ མ་ སོང་བ ར་ རབ་ཏུ་ ཤེས་ སོ །_།
en: Thus they understand perfectly that the thus-gone one has not arrived and that they themselves have not departed.

source: དེ་ འདི་ སྙམ་ དུ་ སེམས་ ཏེ །_ |#| ཆོས་ ཐམས་ཅད་ ནི་ འོངས་པ་ མེད་པ འོ །_། |#| འགྲོ་བ་ མེད་པ འོ་ སྙམ་ མོ །_།
en: They then think, ‘All phenomena are beyond coming and going.’

source: དེ་དེ་ ལྟར་ གནས་ ཤིང་ དེ་ལྟ ར་ བརྩོན་པ ས་
en: Through abiding by and striving in such analysis,

source: རིང་པོ་ མི་ ཐོགས་པ ར་ ཆོས་ ཀྱི་ མིག་ སྒྲིབ་པ་ མེད་པ་ ཐོབ་བོ །_།
en: they obtain before long the unobscured vision of Dharma.

source: ཆོས་ ཀྱི་ མིག་ སྒྲིབ་པ་ མེད་པ་ དེ་ ཐོབ་ ནས་
en: Upon obtaining the unobscured vision of Dharma,

source: དེ་བཞིན་ གཤེགས་པ་ ཡིན་ ཏེ །_
en: they are a thus-gone one, for

source: ཆོས་ ཀྱི་ སྒོ་ གང་ གིས་ མ་ཆགས་པ འི་ སྤོབས་པ་ ཉིད་ འཐོབ་པ འི་ ཆོས་ ཀྱི་ སྒོ་ མངོན་དུ་ བྱེད་ དོ །_།
en: they have actualized the gateway of Dharma through which unimpeded eloquence is obtained.

source: དེ་ ཆོས་ ཀྱང་ སྟོན་པ ར་ བྱེད་ ལ་ ཆོས་ དེ་དག་ ཀྱང་ ཡང་དག་ པར་ རྗེས་སུ་ མི་ མཐོང་ ངོ་ །_།
en: They teach the Dharma, yet they do not truly see those phenomena.

source: བརྟན་པ འི་ བློ་གྲོས་ འདི་ལྟ་སྟེ །_ |#| དཔེར་ན་ འདས་པ འི་ དུས་ ལ་ དེ་བཞིན་ གཤེགས་པ འི་ ཡེ་ཤེས་ མ་ཆགས་པ་ འཇུག་ ཀྱང་
en: $1935 “Dṛḍhamati, it is like this, for example: |#| Even while a thus-gone one’s unimpeded wisdom partakes of the past,

source: ལུས་ རྣམས་ ལ་ དེ་བཞིན་ གཤེགས་པ འི་ ཡེ་ཤེས་ ཐོགས་པ་ ཡང་ མེད་ དོ །_།
en: a thus-gone one’s wisdom also has no impediment with respect to bodies.

source: འདས་པ འི་ དུས་ ལ་ དམིགས་པ འི་ སྒོ་ ནས་ དེ་བཞིན་ གཤེགས་པ འི་ ཡེ་ཤེས་ ཀྱང་ མི་ འཇུག་ ཅིང་
en: A thus-gone one’s wisdom does not partake of the past by means of apprehending.

source: འདས་པ འི་ དུས་ ལ་ དེ་བཞིན་ གཤེགས་པ འི་ ཡེ་ཤེས་ མི་ འཇུག་ ཀྱང་ །_
en: Even though a thus-gone one’s wisdom does not partake of the past,

source: འདས་པ འི་ དུས་ ལ་ དེ་བཞིན་ གཤེགས་པ་ ནི་ ཡེ་ཤེས་ མངའ་བ་ ཉིད་ དེ་ འདས་པ འི་ དུས་ ལ་ དེ་བཞིན་ གཤེགས་པ འི་ དམིགས་པ འི་ ལུས་ རྗེས་སུ་ འཇུག་པ་ ཡང་ མ་ ཡིན་ ནོ །_།
en: the wisdom of a thus-gone one still masters the past. |#| However, with respect to the past, it does not follow after any bodies as observed by a thus-gone one.

source: མ་ འོངས་པ་ དང་ །_ ད་ལྟ ར་ བྱུང་བ་ ལ་ ཡང་ དེ་ དང་ འདྲ འོ །_།
en: The same also goes for the future and the present.

source: བརྟན་པ འི་ བློ་གྲོས་ དེ་བཞིན་ དུ་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་ ནི་ བཀོད་པ་ གཅིག་པ འི་ ཏིང་ངེ་འཛིན་ དེ་ ལ་ གནས་ ནས་ |#| ཆོས་ ཀྱང་ སྟོན་པ ར་ བྱེད་ ལ །_
en: Dṛḍhamati, it is in this manner that while abiding in the absorption of the single array , bodhisattvas teach the Dharma, although

source: ཆོས་ དེ་དག་ ཀྱང་ ཡང་དག་ པར་ རྗེས་སུ་ མི་ མཐོང་ ངོ་ །_།
en: they do not even truly see those phenomena.

source: དེ་ ཤིན་ཏུ་ བསྒོམས་པ ས་ ཏིང་ངེ་འཛིན་ དེ་ ལ་ གནས་ [219b] ནས་ འཇིག་རྟེན་ གྱི་ ཁམས་ གང་ ན་ བཞུགས་པ ར་ འགྱུར་ ཞིང་ །_ བྱང་ཆུབ་ ཀྱི་ སྙིང་པོ་ ན་ བཞུགས་པ འམ །_ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ མངོན་པར་ རྫོགས་པ ར་ འཚང་རྒྱ་བ འམ །_ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ འམ །_ ཆོས་སྟོན་པ འི་ དེ་བཞིན་ གཤེགས་པ་ གཉིས་པ་ ཡིད་ ལ་ བྱེད །_ |#| དམིགས་པ ར་ བྱེད །_ |#| མངོན་དུ་ བྱེད་ དོ །_།
en: $1936 “Abiding in that absorption through having strongly cultivated it [219.b] causes them to bring to mind, perceive, and manifest before themselves a second thus-gone one, either coming to reside in some world system and sitting down at the seat of awakening, or fully awakening to unexcelled and perfect buddhahood, or turning the wheel of Dharma, or teaching the Dharma.

source: དེ་དེ་ བཞིན་ གཤེགས་པ འི་ ཆོས་ བསྟན་པ་ དེ་ཡང་ ཀུན་ ལེན་པ ར་ བྱེད །_ |#| འཛིན་པ ར་ བྱེད་ དོ །_།
en: They thus also receive and uphold the Dharma taught by that thus-gone one.

source: དེ་དེ་ བཞིན་ གཤེགས་པ་ ལ་ དམིགས་པ་ སྔ་མ་ དེ་ཡང་ དམིགས་པ ར་ བྱེད་ ཅིང་ །_
en: While perceiving the previously perceived thus-gone one,

source: དེ་བཞིན་ གཤེགས་པ་ ལ་ དམིགས་པ་ འདི་ ཡང་ གཏོང་ བ ར་ མི་ བྱེད་ དོ །_།
en: they do not discard this perception of a second thus-gone one.

source: དེ་ ཆོས་སྟོན་པ འི་ དེ་བཞིན་ གཤེགས་པ་ དེ་ གཉི་ག་ དམིགས་པ ར་ བྱེད །_ |#| མངོན་དུ་ བྱེད་ དེ །_
en: They thus perceive and actualize both thus-gone ones teaching the Dharma.

source: བརྟན་པ འི་ བློ་གྲོས་ འདི་ ཡང་ བཀོད་པ་ གཅིག་པ འི་ ཏིང་ངེ་འཛིན་ མངོན་པར་ བསྒྲུབ་པ་ ཡིན་ ནོ །_།
en: Dṛḍhamati, this too is the accomplishment of the absorption of the single array.

source: བརྟན་པ འི་ བློ་གྲོས་ གཞན་ ཡང་ བྱང་ཆུབ་ སེམས་དཔའ་ ནི་ དེ་བཞིན་ གཤེགས་པ་ ལ་ དམིགས་པ་ གཅིག་ ལེགས་པ ར་ ཀུན་ བཟུང་ ཞིང་ ལེགས་པ ར་ བརྟགས་ ལ །_ ལེགས་པ ར་ བྱང་བ ར་ བྱས་ ནས་
en: $1937 “Furthermore, Dṛḍhamati, once bodhisattvas have retained well and imagined well, to the point of great mastery, one perception of a thus-gone one,

source: དེ་བཞིན་ གཤེགས་པ་ ཇི་སྙེད་ འདོད་པ་ དེ་སྙེད་ ཡིད་ ལ་ བྱེད་ དོ །_།
en: they can then bring to mind as many thus-gone ones as they wish.

source: བརྟན་པ འི་ བློ་གྲོས་ འདི་ལྟ་སྟེ །_ |#| དཔེར་ན་ ལུས་ ཀྱི་ སྐྱེ་མཆེད་ དག་ ལ་ དགེ་སློང་ དབང་ དུ་ གྱུར་པ་ དེ་ དམིགས་པ་ སྔོན་པོ་ ཡིད་ ལ་ བྱེད་ དོ །_།
en: Dṛḍhamati, it is just like how a masterful monk can bring to mind the perception of the physical sense sources as being blue.

source: དེ་ ཐམས་ཅད་ ཀྱང་ གང་ཅི་ ཡང་ རུང་བ་ ཐམས་ཅད་ དམིགས་པ་ སྔོན་པོ་ ཁོ་ན ར་ མོས་པ ར་ བྱེད་ དེ །_
en: He can imagine all of them, everything whatsoever, as only blue, such that

source: སྔོན་པོ་ ཁོ་ན་ ཡིན་པ་ མ་གཏོགས་ པར་ དེ་ ལ་ དམིགས་པ་ ཅི་ཡང་ མངོན་དུ་ མི་ འགྱུར་ རོ །_།
en: no perception of them manifests in any other way apart from blue.

source: དེ་ འགྲོ་བ་ ཐམས་ཅད་ སྔོན་པོ་ ཁོ་ན ར་ མོས་པ ར་ བྱེད་ ཅིང་ བྱིན་ གྱིས་ རློབ་པ ར་ བྱེད་ ལ །_ སྔོན་པོ་ ཁོ་ན ར་ མངོན་དུ་ བྱེད་ དོ །_།
en: He imagines and transforms all beings into only blue, manifesting them as only blue.

source: ནང་ དང་ ཕྱི འི་ ཆོས་ རྣམས་ ལ་ དེ འི་ ཤེས་པ་ སྔོན་པོ འོ་ སྙམ་ དུ་ འཇུག་ ཅིང་ །_ དེ་ ལ་ དེ་ ནི་ དབང་ དུ་ གྱུར་པ་ ཡང་ ཡིན་ ནོ །_།
en: He perceives all internal and external phenomena with the thought that they are blue and he also gains mastery in that.

source: !བརྟན་པ འི་ བློ་གྲོས་ དེ་བཞིན་ དུ་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་ ནི་ འཇིག་རྟེན་ གྱི་ ཁམས་ གང་དང་གང་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཇི་སྙེད་ བཞུགས་པ་ ཐོས་པ ར་ གྱུར་པ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ རྣམས་ དང་ དེ་བཞིན་ གཤེགས་པ འི་ དེ་དག་ ཀྱང་ ཡིད་ ལ་ བྱེད་ དོ །_།
en: Dṛḍhamati, in the same way do bodhisattvas bring to mind the various world systems in which they have heard that myriad thus-gone ones reside, as well as the thus-gone ones#87 themselves.

source: དེ་དེ་ བཞིན་ གཤེགས་པ་ ལ་ དམིགས་པ འི་ ཡིད་ ལ་ བྱེད་པ་ ཤིན་ཏུ་ ལེགས་པ ར་ བརྟགས་པ་ ཤིན་ཏུ་ ངེས་པ ར་ བྱ་བ་ དེས་ འགྲོ་བ་ ཐམས་ཅད་ ནི་ དེ་བཞིན་ གཤེགས་པ འོ །_། |#| སངས་རྒྱས་ སོ །_། |#| རང་བྱུང་ ངོ་ ཞེས་ བྱིན་ གྱིས་ རློབ་པ ར་ བྱེད་ དོ །_།
en: $1938 “Through bringing to mind a perception of thus-gone ones that is well imagined and well ascertained, they transform all beings and name them ‘thus-gone ones, buddhas, self-arisen ones.’ [220.a]

source: དེ་དེ་ བཞིན་ [220a] གཤེགས་པ་ ལ་ དམིགས་པ འི་ ཡིད་ ལ་ བྱེད་པ་ དེ་ ཤིན་ཏུ་ ཡིད་ ལ་ བྱེད་པ ས་ དམིགས་པ་ ཐམས་ཅད་ ནི་ འདི་ལྟ་སྟེ །_ |#| དེ་བཞིན་ གཤེགས་པ་ མངོན་དུ་ འགྱུར་བ འི་ དམིགས་པ་ གཅིག་ ཏུ་ བྱིན་ གྱིས་ རློབ་པ ར་ བྱེད་ དོ །_།
en: By bringing to mind a mentally created perception of thus-gone ones, all perceptions are transformed by them into a single perception in which only thus-gone ones manifest.

source: དེ་དེ་ བཞིན་ གཤེགས་པ་ ལས་ དམིགས་པ འི་ དངོས་པོ་ གཞན་ ཅི་ཡང་ ཡང་དག་ པར་ རྗེས་སུ་ མི་ མཐོང་ ངོ་ །_། |#| གཞན་ དུ་ ན་ སངས་རྒྱས་ ཉག་གཅིག་ མ་གཏོགས་ ཏེ །_
en: They do not see anything at all that is not perceived as thus-gone ones, or exclusively as buddhas.

source: བཅོམ་ལྡན་འདས་ ཏིང་ངེ་འཛིན་ དེ འི་ མངོན་པར་ སྒྲུབ་པ་ དེ་ གང་ ལགས །_
en: “Blessed One, what is the accomplishment of that absorption?”

source: འདི་ ལྟ་སྟེ །_ |#| དེ་བཞིན་ གཤེགས་པ་ ཐམས་ཅད་ ལ་ དམིགས་པ འི་ སེམས་ རྩེ་གཅིག་པ་ ཉིད་ མི་ གཏོང་བ་ སྟེ །_
en: $1939 “It is that the one-pointed mental perception of all thus-gone ones is not discarded,”

source: བརྟན་པ འི་ བློ་གྲོས་ འདི་ ནི་ བཀོད་པ་ གཅིག་པ འི་ ཏིང་ངེ་འཛིན་ མངོན་པར་ སྒྲུབ་པ་ ཡིན་ ནོ །_།
en: “That, Dṛḍhamati, is accomplishing the absorption of the single array .

source: བརྟན་པ འི་ བློ་གྲོས་ ཡང་ གང་ དམིགས་པ་ གཅིག་ གིས་ ཆོས་ ཐམས་ཅད་ རྟོགས་པ་ ནི་ ཐམས་ཅད་ ཀྱི་ ཆོས་ཉིད་ ཀྱང་ ཡིན་ ཏེ །_
en: Dṛḍhamati, that all phenomena are understood with a single perception is also the nature of everything—

source: བརྟན་པ འི་ བློ་གྲོས་ འདི་ ནི་ བཀོད་པ་ གཅིག་པ འི་ ཏིང་ངེ་འཛིན་ ཅེས་ བྱ འོ །_།
en: this, Dṛḍhamati, is called the absorption of the single array .

source: བྱང་ཆུབ་ སེམས་དཔའ་ ནི་ ཏིང་ངེ་འཛིན་ དེ་ ལ་ གནས་ ནས་ |#| ངག་ ཐམས་ཅད་ ནི་ དེ་བཞིན་ གཤེགས་པ འི་ ངག་གོ །_། ལུས་ ཐམས་ཅད་ ནི་ དེ་བཞིན་ གཤེགས་པ འི་ སྐུ འོ་ སྙམ་ དུ་ དེ་ལྟ ར་ འཇུག་པ ར་ བྱེད་ ཅིང་ །_ དེ་ལྟ ར་ མོས་པ ར་ བྱེད་ དོ །_།
en: Bodhisattvas, while abiding in that absorption, think, ‘All speech is the speech of the thus-gone ones; |#| all bodies are the bodies of the thus-gone ones.’ |#| Such is their practice and belief.

source: བརྟན་པ འི་ བློ་གྲོས་ གཞན་ ཡང་ བྱང་ཆུབ་ སེམས་དཔའ་ ནི་ དེ་བཞིན་ གཤེགས་པ་ གཉིས་ དང་ །_ གསུམ་ དང་ །_ བཞི་ དང་ །_ ལྔ་ དང་ །_ བཅུ་ དང་ །_ བརྒྱ འི་ བར་ དང་ །_ འབུམ་ གྱི་ བར་ གྱི་ མཚན་ དག་ ཉན་པ ར་ བྱེད་ ཅིང་ །_ དེ་དག་ ཐམས་ཅད་ དུས་ གཅིག་ ཏུ་ མངོན་དུ་ བྱེད་ ཡིད་ ལ་ བྱེད་ དོ །_།
en: $1940 “Moreover, Dṛḍhamati, bodhisattvas proclaim the names of two, three, four, five, ten—up to one hundred, and up to one hundred thousand—thus-gone ones, manifesting and bringing them all to mind simultaneously.

source: དེ་བཞིན་ གཤེགས་པ་ དེ་དག་ གི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ གི་ བཀོད་པ་ དང་ ཉན་ཐོས་ ཀྱི་ བཀོད་པ་ དེ་དག་ ཐམས་ཅད་ ཀྱང་ མངོན་དུ་ བྱེད །_ |#| ཡིད་ ལ་ བྱེད་ དོ །_།
en: They also manifest and bring to mind all the arrays of buddha realms and arrays of hearers belonging to those thus-gone ones.

source: དེ་བཞིན་ གཤེགས་པ་ དེ་དག་ གི་ གཟུགས་ ཕུན་སུམ་ ཚོགས་པ་ དང་ །_ མཚན་ ཕུན་སུམ་ ཚོགས་པ་ དང་ །_ མདོག་ ཕུན་སུམ་ ཚོགས་པ་ དང་ །_ སྐུ་ ཕུན་སུམ་ ཚོགས་པ་ དང་ །_ ཆུ་ཞེང་ ཕུན་སུམ་ ཚོགས་པ་ ཡང་ མངོན་དུ་ བྱེད །_ |#| ཡིད་ ལ་ བྱེད །_ |#| མདུན་ དུ་ བྱེད་ དོ །_།
en: They also manifest, bring to mind, and bring forth the perfect forms, perfect characteristics, perfect complexions, perfect bodies, and perfect proportions belonging to those thus-gone ones.

source: སྐྱེས་བུ་ ཆེན་པོ འི་ མཚན་ རེ་རེ འི་ མཚན་མ་ ཡང་ འཛིན་པ ར་ བྱེད་ དོ །_།
en: They apprehend the characteristics of each of the traits of a great being.

source: མ་ རྨོངས་པ ར་ རྣམ་པར་ གཤེགས་པ འི་ མཚན་མ་ དང་ །_ སེང་གེ འི་ རྣམ་པར་ བསྒྱིངས་པ འི་ མཚན་མ་ དང་ །_ [220b] སྤྱི་གཙུག་ བལྟ ར་ མི་ མཐོང་བ འི་ མཚན་མ་ དང་ །_ འོད་ འདོམ་གང་ གི་ མཚན་མ་ ཡང་ འཛིན་པ ར་ བྱེད་ དོ །_།
en: They apprehend the characteristics of walking without delusion, having the gait of a lion, [220.b] the invisible crown protuberance, and the full fathom of light enveloping him.

source: འོད་ འདོམ་གང་པོ་ དེ་ཡང་ འོད་ མཐའ་ཡས་པ་ ཉིད་ དུ་ མོས་པ ར་ བྱེད་ དེ་ བྱིན་ གྱིས་ རློབ་པ ར་ བྱེད་ དོ །_།
en: They also transform that full fathom of light, imagining it to be infinite light.

source: འོད་ མཐའ་ཡས་པ་ ཉིད་ ཀྱང་ ཀུན་ ཏུ་ ཤེས་ སོ །_། |#| སངས་རྒྱས་ ཀྱི་ ཞིང་ མཐའ་ཡས་པ་ ཉིད་ ཀྱང་ འཛིན་ པ ར་ བྱེད་ དོ །_།
en: They perfectly cognize the infinity of light and apprehend an infinity of buddha realms.

source: སངས་རྒྱས་ ཀྱི་ ཞིང་ གི་ བཀོད་པ་ དཔག་ ཏུ་ མེད་པ་ ཡང་ བྱིན་ གྱིས་ རློབ་པ ར་ བྱེད །_ |#| མོས་པ ར་ བྱེད་ ཅིང་ ཀུན་ ཏུ་ ཤེས་ སོ །_།
en: They also transform, bring to mind, and perfectly cognize immeasurable arrays of buddha realms, while

source: ཉན་ཐོས་ ཀྱི་ བཀོད་པ་ མཐའ་ཡས་པ་ ཡང་ ཀུན་ ཏུ་ ཤེས་ ཤིང་མོ ས་ པར་ བྱེད །_ |#| བྱིན་ གྱིས་ རློབ་པ ར་ བྱེད་ དོ །_།
en: they also fully comprehend, bring to mind, and transform an infinite array of hearers.

source: དེ་ཡང་ འདི་ལྟར་ སོ་སོ ར་ རྟོག་པ ར་ བྱེད་ དེ་དེ་ བཞིན་ གཤེགས་ པ་ དེ་དག་ ག་ལ ས་ འོངས་པ་ དག་ ཀྱང་ གང་ དུ་ སོང་ ཞིག་ གུ་ སྙམ་ ནས །_ |#| དེ་དེ་ བཞིན་ གཤེགས་པ་ དང་ བདག་ཉིད་ ཀྱི་ མ་འོངས་པ་ ཉིད་ དང་ །_ མ་ སོང་བ་ ཉིད་ ལ་ འཇུག་པ ར་ བྱེད་ ཅིང་ ཀུན་ ཏུ་ ཤེས་ ལ་མོ ས་ པར་ བྱེད་ དོ །_།
en: $1941 “Moreover, they analyze by thinking, ‘Where did the thus-gone ones come from, and where have I gone?’ |#| Being immersed in this thought, they are brought to the belief that the thus-gone ones and they themselves are beyond coming or going.

source: འདི་ ལ་ དེ་བཞིན་ གཤེགས་པ་ ཞེས་ བྱ་བ འི་ ཆོས་ གང་ཡང་ མེད་ དོ །_།
en: ‘There is no phenomenon whatsoever called thus-gone one and

source: བདག་ ཅེས་བྱ་བ འི་ ཆོས་ ཀྱང་ གང་ཡང་ མེད་ དོ་ སྙམ་ མོ །_།
en: there is no phenomenon whatsoever called self .’

source: དེ་ འདི་ལྟར་ སོ་སོ ར་ རྟོག་པ ར་ བྱེད་ དེ །_ |#| ཆོས་ ཐམས་ཅད་ ཀྱང་ དེ་བཞིན་ དུ་ འགྱུར་ རོ་ སྙམ་ མོ །_།
en: They continue to analyze, thinking, ‘All phenomena are the same.’

source: དེ་དེ་ ལྟར་ སོ་སོ ར་ རྟོག་པ ས་ ཆོས་ ཐམས་ཅད་ མཚན་ཉིད་ གཅིག་ གོ་ སྙམ་ དུ་ མོས་པ ར་ བྱེད །_ |#| འཇུག་པ ར་ བྱེད་ དོ །_།
en: Through analyzing thus, they come to the belief that all phenomena are identical in characteristic.

source: དེ་དེ་ ལྟར་ མངོན་པར་ འདུ་བྱེད་པ་ མེད་པ འི་ མཚན་ཉིད་ ཀྱིས་ མཚན་ཉིད་ དག་ ནི་ ཆོས་ རྣམས་ སོ་ སྙམ་ དུ་ འཇུག་པ ར་ བྱེད་ མོས་པ ར་ བྱེད་ ཅིང་ ཀུན་ ཏུ་ ཤེས་ ལ་ བྱིན་ གྱིས་ རློབ་པ ར་ བྱེད་ དོ །_།
en: As they engage in, believe in, and perfectly understand the thought, ‘All phenomena are characterized by the characteristic of being unformed,’ they thus transform phenomena.

source: དེ་ ཆོས་ ཐམས་ཅད་ མཚན་ཉིད་ མེད་པ་ ཉིད་ ཀྱིས་ མཚན་ཉིད་ གཅིག་པ ར་ འཇུག་པ ར་ བྱེད་ དོ །_།
en: They thus perceive all phenomena as having a single characteristic by way of being without characteristics.

source: !བརྟན་པ འི་ བློ་གྲོས་ ཇི་སྙམ་ དུ་ སངས་རྒྱས་ དུ་མ་ མངོན་པར་ སྒྲུབ་པ་ ནི་ སེམས་ རྩེ་གཅིག་པ་ ཉིད་ ཀྱང་ ཡིན་ ཏེ །_
en: $1942 “Dṛḍhamati, however many#88 buddhas are accomplished, the one-pointed state of mind remains, for,

source: གང་ སངས་རྒྱས་ སུ་ མཚན་ཉིད་ གཅིག་པ་ དང་ མཚན་ཉིད་ མེད་པར་ མངོན་པར་ སྒྲུབ་པ་ འདི་ ནི་ བཀོད་པ་ གཅིག་པ འི་ ཏིང་ངེ་འཛིན་ ཅེས་ བྱ འོ །_།
en: This accomplishment in which everything has the single characteristic of being buddhas, yet also has no characteristics, is known as the absorption of the single array .

source: དེ་ ཏིང་ངེ་འཛིན་ དེ་ ལ་ གནས་ ནས་ དེ་ བཞིན་ གཤེགས་པ་ མ་ཡིན་པ འོ་ སྙམ་ དུ་ གང་ཅི་ ཡང་ ཀུན་ ཏུ་ མི་ ཤེས་ སོ །_།
en: While abiding in that absorption, one does not have the thought, ‘This is not a thus-gone one.’

source: ཆོས་མ་ ཡིན་པ འོ་ སྙམ་ དུ་ གང་ཅི་ ཡང་ ཀུན་ ཏུ་ མི་ ཤེས་ སོ །_།
en: One does not have the thought, ‘This is not a phenomenon.’

source: ཉན་ཐོས་ མ་ཡིན་པ འོ་ སྙམ་ དུ་ གང་ཅི་ ཡང་ ཀུན་ ཏུ་ མི་ ཤེས་ སོ །_།
en: One does not have the thought, ‘This is not a hearer.’

source: ཉན་ཐོས་ སོ་ སྙམ་ དུ་ ཡང་ མི་ དམིགས་ སོ །_།
en: Nor does one perceive or think, ‘hearer.’

source: ཆོས་ བསྟན་པ་ མ་ཡིན་པ འོ་ སྙམ་ དུ་ གང་ཅི་ ཡང་ ཀུན་ [221a] ཏུ་ མི་ ཤེས་ སོ །_།
en: One does not have the thought, ‘The Dharma is not taught.’ [221.a]

source: ཆོས་ བསྟན་པ་ ཡང་ མི་ དམིགས་ སོ །_།
en: Nor does one perceive the Dharma being taught.

source: དམིགས་པ་ མ་ཡིན་པ འོ་ སྙམ་ དུ་ གང་ཅི་ ཡང་ ཀུན་ ཏུ་ མི་ ཤེས་ སོ །_།
en: One does not have the thought, ‘This is not perceived,’

source: དམིགས་པ་ ཡང་ མི་ དམིགས་ སོ །_།
en: nor does one perceive perception.

source: སངས་རྒྱས་ ཀྱི་ ཞིང་ མ་ཡིན་པ འོ་ སྙམ་ དུ་ གང་ཅི་ ཡང་ ཀུན་ ཏུ་ མི་ ཤེས་ སོ །_།
en: One does not have the thought, ‘It is not a buddha realm,’

source: སངས་རྒྱས་ ཀྱི་ ཞིང་ ཡང་ མི་ དམིགས་ སོ །_།
en: nor does one perceive buddha realms.

source: འཁོར་མ་ ཡིན་པ འོ་ སྙམ་ དུ་ གང་ཅི་ ཡང་ ཀུན་ ཏུ་ མི་ ཤེས་ སོ །_།
en: One does not have the thought, ‘It is not the retinue,’

source: འཁོར་ ཀྱང་ མི་ དམིགས་ སོ །_།
en: nor does one perceive the retinue.

source: སྤོབས་པ་ མ་ཡིན་པ འོ་ སྙམ་ དུ་ གང་ཅི་ ཡང་ ཀུན་ ཏུ་ མི་ ཤེས་ སོ །_།
en: One does not have the thought, ‘It is not eloquence,’

source: སྤོབས་པ་ ཡང་ མི་ དམིགས་ སོ །_།
en: nor does one perceive eloquence.

source: རབ་ཏུ་ བརྗོད་པ་ མ་ཡིན་པ འོ་ སྙམ་ དུ་ གང་ཅི་ ཡང་ ཀུན་ ཏུ་ མི་ ཤེས་ སོ །_།
en: One does not have the thought, ‘This is not expression,’

source: རབ་ ཏུ་ བརྗོད་པ་ ཡང་ མི་ དམིགས་ སོ །_།
en: nor does one perceive expression.

source: བྱིན་ གྱིས་ རློབ་པ་ མ་ཡིན་པ་ གང་ཅི་ ཡང་ ཀུན་ ཏུ་ མི་ ཤེས་ སོ །_།
en: One does not have the thought, ‘This is not transforming,’

source: བྱིན་ གྱིས་ བརླབས་ ཀྱང་ མི་ དམིགས་ སོ །_།
en: nor does one perceive anything transformed.

source: མོས་པ ར་ མི་ བྱེད་པ་ གང་ཅི་ ཡང་ མེད་ དོ །_།
en: There is nothing at all that one does not believe,

source: མོས་པ་ ཡང་ མི་ དམིགས་ སོ །_།
en: nor does one perceive any belief.

source: རློམ་སེམས་ མི་ བྱེད་པ་ གང་ཅི་ ཡང་ མེད་ དོ །_།
en: There is no absence of thinking at all,

source: རློམ་སེམས་ ཀྱང་ མི་ དམིགས་ སོ །_།
en: nor does one perceive any thinking.

source: སྒོམ་པ ར་ མི་ བྱེད་པ་ གང་ཅི་ ཡང་ མེད་ དོ །_།
en: There is no absence of cultivation at all,

source: སྒོམ་པ་ ཡང་ མི་ དམིགས་ སོ །_།
en: nor does one perceive cultivation.

source: རྣམ་པར་ མི་ འབྱེད་པ་ གང་ཅི་ ཡང་ མེད་ དོ །_།
en: There is no absence of discernment at all,

source: རྣམ་པར་ འབྱེད་པ་ ཡང་ མི་ དམིགས་ སོ །_།
en: nor does one perceive discernment.

source: གསལ་བ ར་ མི་ བྱེད་པ་ གང་ཅི་ ཡང་ མེད་ དོ །_།
en: There is no absence of clarification at all,

source: གསལ་བ་ ཡང་ མི་ དམིགས་ སོ །_།
en: nor does one perceive clarification.

source: རབ་ཏུ་ སྟོན་པ ར་ མི་ བྱེད་པ་ གང་ཅི་ ཡང་ མེད་ དོ །_།
en: There is nothing at all that one does not teach,

source: རབ་ཏུ་ སྟོན་པ་ ཡང་ མི་ དམིགས་ ཏེ །_
en: nor does one perceive teaching.

source: བརྟན་པ འི་ བློ་གྲོས་ འདི་ ནི་ གང་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ ཡེ་ཤེས་ སྒྲིབ་པ་ མེད་པ་ མཐོང་བ ར་ འགྱུར་བ འི་ ཆོས་ ཐམས་ཅད་ ཀྱི་ ཏིང་ངེ་འཛིན་ མངོན་པར་ སྒྲུབ་པ་ ཞེས་ བྱ འོ །_།
en: Dṛḍhamati, this is called the accomplishment of the absorption of all phenomena seen by the unobstructed wisdom of bodhisattvas .

source: འདི་ ལ་ གང་ མིག་ གི་ ཆགས་པ་ མེད་པ་ ཉིད་ འདི་ ནི་ མ་ ཆགས་པ་ ཉིད་ ཅེས་ བྱ འོ །_།
en: The very absence of visual impediment is called unimpededness .

source: གང་ ཆོས་ དེ་ལྟ་ བུ་ དག་ ལ་ འཇུག་པ་ འདི་ ནི་ ཆོས་ ཀྱི་ མིག་ ཅེས་ བྱ འོ །_།
en: That which perceives such phenomena is called the vision of Dharma .

source: བྱང་ཆུབ་ སེམས་དཔའ་ གང་ གིས་ སྤོབས་པ་ མཐའ་ཡས་པ་ ཉིད་ རྗེས་སུ་ འཐོབ་པ ར་ འགྱུར་བ་ དེ་ ནི་ ཏིང་ངེ་འཛིན་ ཡིན་ ནོ །།_།།
en: Absorption is that by which bodhisattvas attain infinite eloquence.”

source: དེ་ནས་ བཅོམ་ ལྡན་འདས་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ བརྟན་པ འི་ བློ་གྲོས་ ཀྱིས་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: $1943 The bodhisattva great being Dṛḍhamati then said to the Blessed One,

source: བཅོམ་ལྡན་འདས་ སླད་མ འི་ ཚེ་ སླད་མ འི་ དུས་ ན་ གང་དག་ ཏིང་ངེ་འཛིན་ དེ་ ལ་ སྙོམས་པ ར་ འཇུག་ ཅིང་ ཏིང་ངེ་འཛིན་ དེས་ ངེས་པ ར་ འབྱུང་ ལ །_ སྤོབས་པ་ མཐའ་ཡས་པ་ ཡང་ ཐོབ་པ ར་ འགྱུར་བ འི་ [221b] བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ཇི་སྙེད་ ཅིག་ འབྱུང་བ ར་ འགྱུར་ ལགས །_
en: “Blessed One, in the future there will appear myriad bodhisattva great beings who enter attainment in that absorption, reach perfection through that absorption, and thereby also attain infinite eloquence.” [221.b]
